БИТУправление_медицинским_центром_демо/src/Documents/ВводНачальныхОстатковПоНакоплениямСкидок/ВводНачальныхОстатковПоНакоплениямСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводНачальныхОстатковПоНакоплениямСкидок</name>
  <registerRecords>AccumulationRegister.НакопленияПоСкидкам</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Накопления</name>
    <attributes>
      <name>Получатель</name>
      <type>
        <types>CatalogRef.Клиенты</types>
        <types>CatalogRef.КартыСкидок</types>
      </type>
    </attributes>
    <attributes>
      <name>Накопление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/НакопленияПоСкидкам/НакопленияПоСкидкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НакопленияПоСкидкам</name>
  <resources>
    <name>Накопление</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Клиенты</types>
      <types>CatalogRef.КартыСкидок</types>
      <types>CatalogRef.ВидыКартСкидок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСкидки</name>
    <type>
      <types>CatalogRef.ВидыСкидок</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/Documents/ВводНачальныхОстатковПоНакоплениямСкидок/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если Не Отказ Тогда
		
		Для Каждого СтрокаНакопления Из Накопления Цикл
			
			Движение = Движения.НакопленияПоСкидкам.Добавить();
			Движение.Период		= Дата;
			Движение.ВидСкидки  = ВидСкидки;
			Движение.Регистратор = Ссылка;
			Движение.Активность = Истина;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаполнитьЗначенияСвойств(Движение, СтрокаНакопления);
			
		КонецЦикла;
		
		Движения.НакопленияПоСкидкам.Записывать = Истина;
	КонецЕсли;
        
КонецПроцедуры // ОбработкаПроведения()

#КонецОбласти
